<a href="https://colab.research.google.com/github/Pabloo22/Data-Science-Libraries-Notes/blob/main/pandas_notes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Apuntes sobre cómo utilizar la librería pandas

Python programmers will often suggest that there many ways the language can be used to solve a particular problem. But that some are more appropriate than others. The best solutions are celebrated as Idiomatic Python and there are lots of great examples of this on StackOverflow and other websites.

A sort of sub-language within Python, Pandas has its own set of idioms. We've alluded to some of these already, such as using vectorization whenever possible, and not using iterative loops if you don't need to. Several developers and users within the Panda's community have used the term pandorable for these idioms.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.DataFrame.__init__??

In [ ]:
init_dict??

Object `init_dict` not found.

## DataFrames

### Creación de DataFrames

#### A partir de Series

In [ ]:
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

school_df = pd.DataFrame([record1, record2, record3],
                  index=['school1', 'school2', 'school1'])

school_df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

#### A partir de listas de diccionarios

In [ ]:
students = [{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]

school_df = pd.DataFrame(students, index=['school1', 'school2', 'school1'])
school_df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

#### A partir de archivos csv

In [ ]:
df_california_housing_train = pd.read_csv(
    "sample_data/california_housing_train.csv")
df_california_housing_train.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

También se pueden convertir hojas de cálculo y otros tipo de archivos a DataFrame. Incluso se pueden crear DataFrames a partir de páginas web!!

### Indíces

In [ ]:
# we can use the rename() function It takes a
# parameter called columns, and we need to pass into a dictionary which the keys 
# are the old column name and the value is the corresponding new column name

# Ejemplo:
# new_df=df.rename(columns={'GRE Score':'GRE Score', 'TOEFL Score':'TOEFL Score',
#                    'University Rating':'University Rating', 
#                    'SOP': 'Statement of Purpose','LOR': 'Letter of Recommendation',
#                    'CGPA':'CGPA', 'Research':'Research',
#                    'Chance of Admit':'Chance of Admit'})
# new_df.head()

In [ ]:
# A continuación vamos a cambiar a mayúsculas los índices de las columnas de
# df_california_housing_train

columnas = list(df_california_housing_train.columns)
columnas = [x.upper() for x in columnas]
df_california_housing_train.columns = columnas
df_california_housing_train.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
df = df_california_housing_train.copy()
df = df.set_index('HOUSING_MEDIAN_AGE')
df.head()

                    LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
HOUSING_MEDIAN_AGE                       ...
15.0                  -114.31     34.19  ...         1.4936             66900.0
19.0                  -114.47     34.40  ...         1.8200             80100.0
17.0                  -114.56     33.69  ...         1.6509             85700.0
14.0                  -114.57     33.64  ...         3.1917             73400.0
20.0                  -114.57     33.57  ...         1.9250             65500.0

[5 rows x 8 columns]

In [ ]:
df = df.reset_index()
df.head()

   HOUSING_MEDIAN_AGE  LONGITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0                15.0    -114.31  ...         1.4936             66900.0
1                19.0    -114.47  ...         1.8200             80100.0
2                17.0    -114.56  ...         1.6509             85700.0
3                14.0    -114.57  ...         3.1917             73400.0
4                20.0    -114.57  ...         1.9250             65500.0

[5 rows x 9 columns]

### Consultas

#### Por índice

In [ ]:
school_df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [ ]:
school_df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

#### Por columnas

In [ ]:
# Panda reserves the indexing operator 
# directly on the DataFrame for column selection. In a Panda's DataFrame, columns always have a name. 
# So this selection is always label based, and is not as confusing as it was when using the square 
# bracket operator on the series objects. For those familiar with relational databases, this operator 
# is analogous to column projection.
school_df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

#### Por índice y columnas a la vez

In [ ]:
school_df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

#### Por valor

In [ ]:
school_df.where(school_df['Name'] == 'Alice')

          Name    Class  Score
school1  Alice  Physics   85.0
school2    NaN      NaN    NaN
school1    NaN      NaN    NaN

In [ ]:
df = df_california_housing_train.copy()
df.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
(df['HOUSING_MEDIAN_AGE'] > 14) & (df['MEDIAN_HOUSE_VALUE'] < 80_000)

0         True
1        False
2        False
3        False
4         True
         ...
16995    False
16996     True
16997    False
16998    False
16999    False
Length: 17000, dtype: bool

In [ ]:
# Sin los paréntesis daría error debido a cómo parsea python
# Otra forma de hacerlo para evitar esos errores es:
df['HOUSING_MEDIAN_AGE'].gt(14) & df['MEDIAN_HOUSE_VALUE'].lt(80_000)

0         True
1        False
2        False
3        False
4         True
         ...
16995    False
16996     True
16997    False
16998    False
16999    False
Length: 17000, dtype: bool

### Eliminar datos

#### Drop()

In [ ]:
school_df.drop('school1')

         Name      Class  Score
school2  Jack  Chemistry     82

In [ ]:
# No obstante, no ha modificado el df original
copy_df = school_df.copy()

# Parámetros opcionales:
# inplace; si es True modifica el df en vez de devolver una copia
# axis: 0 (por defecto), significa que te refieres a las filas
#       1, para referirte a 
copy_df.drop("Name", inplace=True, axis=1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [ ]:
# This way of dropping data, however, takes immediate effect 
# on the DataFrame and does not return a view.
del copy_df['Class']
copy_df

         Score
school1     85
school2     82
school1     90

#### Según una cierta condición

###### Method chaining (pandorable)

The general idea behind method chaining is that every method on an object 
returns a reference to that object. The beauty of this is that you can 
condense many different operations on a DataFrame, for instance, into one line 
or at least one statement of code.

In [ ]:
# Borramos las filas que contienen una HOUSING_MEDIAN_AGE distinta a 14
 
# In this code, there's no in place flag being used and you can see that when we 
# first run a where query, then a dropna, then a set_index, and then a rename. 
# You might wonder why the whole statement is enclosed in parentheses and that's 
# just to make the statement more readable.
df_copy = df_california_housing_train.copy()

(df_copy.where(df_copy['HOUSING_MEDIAN_AGE']==14)
    .dropna()
    .head())

     LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
3      -114.57     33.64  ...         3.1917             73400.0
27     -115.37     32.82  ...         1.9375             80900.0
63     -115.53     32.73  ...         1.7350             61200.0
97     -115.58     32.79  ...         1.6635             64400.0
157    -116.22     36.00  ...         1.1471             32900.0

[5 rows x 9 columns]

###### Manera tradicional (más rápida)

In [ ]:
df_copy = df_california_housing_train.copy()

df_copy = df_copy[df_copy['HOUSING_MEDIAN_AGE']==14]
df_copy.head()

     LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
3      -114.57     33.64  ...         3.1917             73400.0
27     -115.37     32.82  ...         1.9375             80900.0
63     -115.53     32.73  ...         1.7350             61200.0
97     -115.58     32.79  ...         1.6635             64400.0
157    -116.22     36.00  ...         1.1471             32900.0

[5 rows x 9 columns]

#### Celdas vacías

In [ ]:
df = df_california_housing_train.copy()

# Añadimos celdas vacías
df['HOUSING_MEDIAN_AGE'] = (df['HOUSING_MEDIAN_AGE']
                  .where(df['HOUSING_MEDIAN_AGE']!=14))
df.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
mask = df.isnull()
mask.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0      False     False  ...          False               False
1      False     False  ...          False               False
2      False     False  ...          False               False
3      False     False  ...          False               False
4      False     False  ...          False               False

[5 rows x 9 columns]

In [ ]:
df = df.dropna()
df.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0

[5 rows x 9 columns]

#### Eliminar columnas

In [ ]:
df.drop(["TOTAL_BEDROOMS"], axis=1)

       LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
4        -114.57     33.57  ...         1.9250             65500.0
5        -114.58     33.63  ...         3.3438             74000.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[16653 rows x 8 columns]

### Añadir datos

In [ ]:
school_df['ClassRanking'] = None
school_df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helen    Biology     90         None

In [ ]:
df_copy = df_california_housing_train.copy()
df_copy.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

### Aplicar funciones a las celdas (Apply)

In [ ]:
df_copy = df_california_housing_train.copy()
df_copy.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
# Queremos añadir una columna que nos diga si 
# hay un barrio está al norte o no

rows = ['TOTAL_BEDROOMS', 'POPULATION']
df_copy['LONGITUDE_INT'] = df_copy['LONGITUDE'].apply(lambda x: int(x))
df_copy

       LONGITUDE  LATITUDE  ...  MEDIAN_HOUSE_VALUE  LONGITUDE_INT
0        -114.31     34.19  ...             66900.0           -114
1        -114.47     34.40  ...             80100.0           -114
2        -114.56     33.69  ...             85700.0           -114
3        -114.57     33.64  ...             73400.0           -114
4        -114.57     33.57  ...             65500.0           -114
...          ...       ...  ...                 ...            ...
16995    -124.26     40.58  ...            111400.0           -124
16996    -124.27     40.69  ...             79000.0           -124
16997    -124.30     41.84  ...            103600.0           -124
16998    -124.30     41.80  ...             85800.0           -124
16999    -124.35     40.54  ...             94600.0           -124

[17000 rows x 10 columns]

#### Sustituir datos vacíos por otros

In [ ]:
# Añadimos celdas vacías
df['HOUSING_MEDIAN_AGE'] = (df['HOUSING_MEDIAN_AGE']
                  .where(df['HOUSING_MEDIAN_AGE']!=14))
df.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0

[5 rows x 9 columns]

### Group By

In [ ]:
df.fillna(0, inplace=True)
df_copy.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_HOUSE_VALUE  LONGITUDE_INT
0    -114.31     34.19  ...             66900.0           -114
1    -114.47     34.40  ...             80100.0           -114
2    -114.56     33.69  ...             85700.0           -114
3    -114.57     33.64  ...             73400.0           -114
4    -114.57     33.57  ...             65500.0           -114

[5 rows x 10 columns]

In [ ]:
df_copy.groupby("LONGITUDE_INT").mean()

                LONGITUDE   LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
LONGITUDE_INT                         ...
-124          -124.137850  40.867850  ...       2.500128        89160.747664
-123          -123.384576  39.608559  ...       2.621447       116822.025424
-122          -122.306209  37.982152  ...       4.262448       256152.038036
-121          -121.572862  38.030561  ...       3.806865       176821.369574
-120          -120.561533  37.216982  ...       3.022577       136085.034731
-119          -119.482466  35.882398  ...       3.197257       135925.958191
-118          -118.302445  34.087092  ...       3.927993       240611.282430
-117          -117.514023  33.591611  ...       4.156972       200755.020276
-116          -116.704860  33.464835  ...       3.381351       141999.750636
-115          -115.577723  32.999109  ...       2.590327        74520.792079
-114          -114.628333  33.870000  ...       2.003083        61704.166667

[11 rows x 9 columns]

In [ ]:
df_copy["LONGITUDE_INT"].unique()

array([-114, -115, -116, -117, -118, -119, -120, -121, -122, -123, -124])

##### Agrupar mediante funciones

In [ ]:
def valorar_precio(precio):

  if precio < 100_000:
    return "baratas"
  elif precio < 200_000:
    return "con precio medio"
  else:
    return "caras"

df_copy = df_copy.set_index("MEDIAN_HOUSE_VALUE")

In [ ]:
grupo_precio = df_copy.groupby(valorar_precio)
for grupo, frame in grupo_precio:
  print(f"Número de casas {grupo}: {len(frame)}")

Número de casas baratas: 2969
Número de casas caras: 7227
Número de casas con precio medio: 6804

In [ ]:
grupo_precio.mean()

                   LONGITUDE   LATITUDE  ...  MEDIAN_INCOME  LONGITUDE_INT
baratas          -119.789872  36.672604  ...       2.295339    -119.361401
caras            -119.713488  35.354936  ...       5.079685    -119.264287
con precio medio -119.301930  35.455282  ...       3.306155    -118.900059

[3 rows x 9 columns]

In [ ]:
grupo_precio.median()

                  LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  LONGITUDE_INT
baratas             -119.79     36.75  ...         2.1898           -119
caras               -118.47     34.18  ...         4.7500           -118
con precio medio    -118.29     34.11  ...         3.2188           -118

[3 rows x 9 columns]

In [ ]:
grupo_precio["HOUSING_MEDIAN_AGE"].value_counts(normalize=True).loc["baratas"].head()

HOUSING_MEDIAN_AGE
35.0    0.037050
52.0    0.037050
17.0    0.035702
18.0    0.035702
26.0    0.034355
Name: HOUSING_MEDIAN_AGE, dtype: float64

#### Aggregation

In [ ]:
grupo_precio.agg(["median", "mean"])

                 LONGITUDE              ... LONGITUDE_INT
                    median        mean  ...        median        mean
baratas            -119.79 -119.789872  ...          -119 -119.361401
caras              -118.47 -119.713488  ...          -118 -119.264287
con precio medio   -118.29 -119.301930  ...          -118 -118.900059

[3 rows x 18 columns]

In [ ]:
cols = ["TOTAL_ROOMS", "TOTAL_BEDROOMS"]
grupo_precio[cols].agg(["median", "mean", np.average])

                 TOTAL_ROOMS               ... TOTAL_BEDROOMS
                      median         mean  ...           mean     average
baratas               1741.0  2044.094981  ...     450.809363  450.809363
caras                 2411.0  2964.917947  ...     567.383838  567.383838
con precio medio      2029.0  2564.067460  ...     548.360964  548.360964

[3 rows x 6 columns]

In [ ]:
grupo_precio.agg({"TOTAL_ROOMS": ["median", "mean"], 
                  "TOTAL_BEDROOMS": [np.median, np.average]})

                 TOTAL_ROOMS              TOTAL_BEDROOMS
                      median         mean         median     average
baratas               1741.0  2044.094981          384.0  450.809363
caras                 2411.0  2964.917947          454.0  567.383838
con precio medio      2029.0  2564.067460          440.0  548.360964

#### Transformation

In [ ]:
df_copy.reset_index(inplace=True)

In [ ]:
df_copy.head(2)

   MEDIAN_HOUSE_VALUE  LONGITUDE  ...  MEDIAN_INCOME  LONGITUDE_INT
0             66900.0    -114.31  ...         1.4936           -114
1             80100.0    -114.47  ...         1.8200           -114

[2 rows x 10 columns]

In [ ]:
cols = ["LONGITUDE_INT", "TOTAL_ROOMS", "TOTAL_BEDROOMS"]
transform_df = df_copy[cols].groupby("LONGITUDE_INT").transform(np.average)
transform_df

       TOTAL_ROOMS  TOTAL_BEDROOMS
0      2013.291667      464.250000
1      2013.291667      464.250000
2      2013.291667      464.250000
3      2013.291667      464.250000
4      2013.291667      464.250000
...            ...             ...
16995  2023.523364      418.859813
16996  2023.523364      418.859813
16997  2023.523364      418.859813
16998  2023.523364      418.859813
16999  2023.523364      418.859813

[17000 rows x 2 columns]

In [ ]:
new_names = {"TOTAL_ROOMS": "TOTAL_ROOMS_MEAN", 
             "TOTAL_BEDROOMS": "TOTAL_BEDROOMS_MEAN"}
transform_df.rename(new_names, axis="columns", inplace=True)
df_copy = df_copy.merge(transform_df, left_index=True, right_index=True)
df_copy.head()

   MEDIAN_HOUSE_VALUE  LONGITUDE  ...  TOTAL_ROOMS_MEAN  TOTAL_BEDROOMS_MEAN
0             66900.0    -114.31  ...       2013.291667               464.25
1             80100.0    -114.47  ...       2013.291667               464.25
2             85700.0    -114.56  ...       2013.291667               464.25
3             73400.0    -114.57  ...       2013.291667               464.25
4             65500.0    -114.57  ...       2013.291667               464.25

[5 rows x 12 columns]

In [ ]:
df_copy["ROOMS_DIFFER"] = df_copy["TOTAL_ROOMS"] - df_copy["TOTAL_ROOMS_MEAN"]
df_copy["BEDROOMS_DIFFER"] = df_copy["TOTAL_BEDROOMS"] - df_copy["TOTAL_BEDROOMS_MEAN"]
df_copy.head()

   MEDIAN_HOUSE_VALUE  LONGITUDE  ...  ROOMS_DIFFER  BEDROOMS_DIFFER
0             66900.0    -114.31  ...   3598.708333           818.75
1             80100.0    -114.47  ...   5636.708333          1436.75
2             85700.0    -114.56  ...  -1293.291667          -290.25
3             73400.0    -114.57  ...   -512.291667          -127.25
4             65500.0    -114.57  ...   -559.291667          -138.25

[5 rows x 14 columns]

#### Apply

In [ ]:
def calc_mean_HOUSING_MEDIAN_AGE(grupo):
  # grupo es un df de un grupo (en este caso los grupos son los valores de 
  # LONGITUDE_INT)

  avg = np.average(grupo["HOUSING_MEDIAN_AGE"])
  grupo["HOUSING_MEDIAN_AGE_DIFFER"] = grupo["HOUSING_MEDIAN_AGE"] - avg
  return grupo

In [ ]:
df_copy.groupby("LONGITUDE_INT").apply(calc_mean_HOUSING_MEDIAN_AGE).head()

   MEDIAN_HOUSE_VALUE  LONGITUDE  ...  BEDROOMS_DIFFER  HOUSING_MEDIAN_AGE_DIFFER
0             66900.0    -114.31  ...           818.75                      -8.75
1             80100.0    -114.47  ...          1436.75                      -4.75
2             85700.0    -114.56  ...          -290.25                      -6.75
3             73400.0    -114.57  ...          -127.25                      -9.75
4             65500.0    -114.57  ...          -138.25                      -3.75

[5 rows x 15 columns]

In [ ]:
# Queremos dividir las casas en caras o baratas según si están por encima de la
# media o no con respecto a LONGITUDE_INT

media = np.average(df_copy["MEDIAN_HOUSE_VALUE"])

def etiquetar_precio(precio):

  if precio < media:
    return "CHEAP"
  else:
    return "EXPENSIVE"

df_copy["PRICE LABEL"] = \
df_copy["MEDIAN_HOUSE_VALUE"].apply(etiquetar_precio)

df_copy["PRICE LABEL"].value_counts()

CHEAP        10109
EXPENSIVE     6891
Name: PRICE LABEL, dtype: int64

### Scale

In [ ]:
df_notas = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
                index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 
                       'ok', 'ok', 'ok', 'poor', 'poor'],
               columns=["Grades"])

df_notas

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [ ]:
# Now, if we check the datatype of this column, we see that it's just an object, 
# since we set string values
df_notas.dtypes

Grades    object
dtype: object

In [ ]:
df_notas["Grades"].astype("category").head()

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): ['A', 'A+', 'A-', 'B', ..., 'C+', 'C-', 'D', 'D+']

In [ ]:
ordered_categories = ['D', 'D+', 'C-', 'C', 'C+', 
                      'B-', 'B', 'B+', 'A-', 'A', 'A+']
my_categories=pd.CategoricalDtype(categories= ordered_categories, 
                           ordered=True)
grades = df_notas["Grades"].astype(my_categories)
grades.head()

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [ ]:
# Esto no funciona como queremos, ordena por orden alfabético
# porque no habíamos puesto un orden todavía:
df_notas[df_notas["Grades"]>"C"]

     Grades
ok       C+
ok       C-
poor     D+
poor      D

In [ ]:
# esto sí:
grades[grades > "C"]

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

#### cuts

In [ ]:
df_copy2 = df.copy()
df_copy2.head()

   LONGITUDE  LATITUDE  ...  MEDIAN_INCOME  MEDIAN_HOUSE_VALUE
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0

[5 rows x 9 columns]

In [ ]:
df_copy2["HOUSE_VALUE_CATEGORIZED"] = pd.cut(df_copy2["MEDIAN_HOUSE_VALUE"], 5)
df_copy2["HOUSE_VALUE_CATEGORIZED"].value_counts(normalize=True)

(111999.4, 208999.8]     0.380472
(208999.8, 306000.2]     0.218279
(14513.998, 111999.4]    0.217318
(306000.2, 403000.6]     0.098241
(403000.6, 500001.0]     0.085690
Name: HOUSE_VALUE_CATEGORIZED, dtype: float64

### Unir dos DataFrames

In [ ]:

staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])

staff_df = staff_df.set_index('Name')

student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])

student_df = student_df.set_index('Name')
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

In [ ]:
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

There's some overlap in these DataFrames in that James and Sally are both 
students and staff, but Mike and
Kelly are not. Importantly, both DataFrames are indexed along the value we want 
to merge them on, which is called Name.

If we want the union of these, we would call merge() passing in the DataFrame on the left and the DataFrame on the right and telling merge that we want it to use an outer join. We want to use the left and right indices as the joining columns.

In [ ]:
# Outer = Unión
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True,)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [ ]:
# Inner = Intersección
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [ ]:
# Right = Incorporas al df de la derecha las columnas de los elementos en común
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

#### Unir por columnas

In [ ]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

pd.merge(staff_df, student_df, how='right', on='Name')

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

¿Qué ocurre si hay conflicto entre los df?

In [ ]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 
                          'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 
                          'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 
                          'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 
                            'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 
                            'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 
                            'Location': '512 Wilson Crescent'}])

In [ ]:
pd.merge(staff_df, student_df, how='left', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

#### Multi indexing

In [ ]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 
                          'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 
                          'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 
                          'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 
                            'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 
                            'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 
                            'School': 'Engineering'}])
# As you see here, James Wilde and James Hammond don't match on both keys since they have different last
# names. So we would expect that an inner join doesn't include these individuals in the output, and only Sally
# Brooks will be retained.
pd.merge(staff_df, student_df, how='inner', on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

#### Unir por filas (Concatenar)

In [ ]:
frames = [staff_df, student_df]
pd.concat(frames)

  First Name   Last Name            Role       School
0      Kelly  Desjardins  Director of HR          NaN
1      Sally      Brooks  Course liasion          NaN
2      James       Wilde          Grader          NaN
0      James     Hammond             NaN     Business
1       Mike       Smith             NaN          Law
2      Sally      Brooks             NaN  Engineering

In [ ]:
pd.concat(frames, keys=["staff", "student"])

          First Name   Last Name            Role       School
staff   0      Kelly  Desjardins  Director of HR          NaN
        1      Sally      Brooks  Course liasion          NaN
        2      James       Wilde          Grader          NaN
student 0      James     Hammond             NaN     Business
        1       Mike       Smith             NaN          Law
        2      Sally      Brooks             NaN  Engineering

### Pivot Tables

In [ ]:
df_copy.head()

   MEDIAN_HOUSE_VALUE  LONGITUDE  ...  BEDROOMS_DIFFER  PRICE LABEL
0             66900.0    -114.31  ...           818.75        CHEAP
1             80100.0    -114.47  ...          1436.75        CHEAP
2             85700.0    -114.56  ...          -290.25        CHEAP
3             73400.0    -114.57  ...          -127.25        CHEAP
4             65500.0    -114.57  ...          -138.25        CHEAP

[5 rows x 15 columns]

In [ ]:
pivot1 = pd.pivot_table(df_copy, index="LONGITUDE_INT")
pivot1

               BEDROOMS_DIFFER  HOUSEHOLDS  ...  TOTAL_ROOMS  TOTAL_ROOMS_MEAN
LONGITUDE_INT                               ...
-124              2.124988e-15  387.887850  ...  2023.523364       2023.523364
-123             -4.094653e-14  337.483051  ...  1928.669492       1928.669492
-122              1.236659e-13  475.251951  ...  2508.449935       2508.449935
-121              8.691387e-13  510.065309  ...  2778.809835       2778.809835
-120             -1.173629e-13  399.373653  ...  2363.947305       2363.947305
-119             -5.036366e-13  444.114334  ...  2371.386519       2371.386519
-118              2.288204e-13  508.961823  ...  2430.268678       2430.268678
-117             -6.112166e-13  547.862936  ...  3020.812652       3020.812652
-116             -3.355642e-14  644.615776  ...  4041.122137       4041.122137
-115             -9.004898e-15  283.485149  ...  1436.287129       1436.287129
-114              0.000000e+00  321.625000  ...  2013.291667       2013.291667

[11 rows x 13 columns]

In [ ]:
pivot2 = pd.pivot_table(df_copy, index="LONGITUDE_INT", values="POPULATION")
pivot2.head(3)

                POPULATION
LONGITUDE_INT
-124           1015.635514
-123            880.449153
-122           1222.722692

In [ ]:
# No obstante, esto nos devuelve la media por defecto. Si queremos que utilice 
# otra función debemos indicarlo
pivot3 = pd.pivot_table(df_copy, index="LONGITUDE_INT", values="POPULATION", aggfunc="sum")
pivot3.head(3)

               POPULATION
LONGITUDE_INT
-124             108673.0
-123             103893.0
-122            3761095.0

In [ ]:
pivot4 = pd.pivot_table(df_copy, index="LONGITUDE_INT", values="POPULATION", 
                        aggfunc=["sum", "mean"])
pivot4.head(3)

                     sum         mean
              POPULATION   POPULATION
LONGITUDE_INT
-124            108673.0  1015.635514
-123            103893.0   880.449153
-122           3761095.0  1222.722692

In [ ]:
pivot5 = pd.pivot_table(df_copy, index="LONGITUDE_INT", values="POPULATION", 
                        aggfunc=["sum", "mean"], columns="PRICE LABEL")
pivot5.head()

                     sum                    mean
PRICE LABEL        CHEAP  EXPENSIVE        CHEAP    EXPENSIVE
LONGITUDE_INT
-124            108673.0        NaN  1015.635514          NaN
-123             96952.0     6941.0   889.467890   771.222222
-122           1426543.0  2334552.0  1135.782643  1282.720879
-121           2528721.0  1261404.0  1428.655932  1514.290516
-120            842532.0   131090.0  1149.429741  1285.196078

In [ ]:
pivot5.stack().head()

                                 sum         mean
LONGITUDE_INT PRICE LABEL
-124          CHEAP         108673.0  1015.635514
-123          CHEAP          96952.0   889.467890
              EXPENSIVE       6941.0   771.222222
-122          CHEAP        1426543.0  1135.782643
              EXPENSIVE    2334552.0  1282.720879

In [ ]:
pivot6 = pd.pivot_table(df_copy, index="LONGITUDE_INT", values="POPULATION", 
                        aggfunc=["sum", "mean"], columns="PRICE LABEL", 
                        fill_value=0, margins=True)
pivot6.head()

                   sum            ...         mean
PRICE LABEL      CHEAP EXPENSIVE  ...    EXPENSIVE          All
LONGITUDE_INT                     ...
-124            108673         0  ...     0.000000  1015.635514
-123             96952      6941  ...   771.222222   880.449153
-122           1426543   2334552  ...  1282.720879  1222.722692
-121           2528721   1261404  ...  1514.290516  1456.060315
-120            842532    131090  ...  1285.196078  1166.014371

[5 rows x 6 columns]

### Trabajar con fechas

#### Timestamp

In [ ]:
# Pandas has four main time related classes. Timestamp, DatetimeIndex, Period, and PeriodIndex. First, let's
# look at Timestamp. It represents a single timestamp and associates values with points in time.

# For example, let's create a timestamp using a string 9/1/2019 10:05AM, and here we have our timestamp.
# Timestamp is interchangeable with Python's datetime in most cases.
pd.Timestamp('9/1/2019 10:05AM')

Timestamp('2019-09-01 10:05:00')

In [ ]:
# We can also create a timestamp by passing multiple parameters such as year, month, date, hour,
# minute, separately
pd.Timestamp(2019, 12, 20, 0, 0)

Timestamp('2019-12-20 00:00:00')

In [ ]:
# Timestamp also has some useful attributes, such as isoweekday(), which shows the weekday of the timestamp
# note that 1 represents Monday and 7 represents Sunday
pd.Timestamp(2019, 12, 20, 0, 0).isoweekday()

5

In [ ]:
# You can find extract the specific year, month, day, hour, minute, second from a timestamp
pd.Timestamp(2019, 12, 20, 5, 2,23).second

23

#### Period

In [ ]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [ ]:
# You'll notice when we print that out that the granularity of the period is M for month, since that was the
# finest grained piece we provided. Here's an example of a period that is March 5th, 2016.
pd.Period('3/5/2016')

Period('2016-03-05', 'D')

In [ ]:
# Period objects represent the full timespan that you specify. Arithmetic on period is very easy and
# intuitive, for instance, if we want to find out 5 months after January 2016, we simply plus 5
pd.Period('1/2016') + 5

Period('2016-06', 'M')

In [ ]:
# From the result, you can see we get June 2016. If we want to find out two days before March 5th 2016, we
# simply subtract 2
pd.Period('3/5/2016') - 2

Period('2016-03-03', 'D')

The key here is that the period object encapsulates the granularity for arithmetic

#### DatetimeIndex and PeriodIndex

In [ ]:
# The index of a timestamp is DatetimeIndex. When we look at the series, each
# Timestamp is the index and has a value associated with it, in this case, a, b and c.

t1 = pd.Series(list('abc'), [pd.Timestamp('2016-09-01'), pd.Timestamp('2016-09-02'), 
                             pd.Timestamp('2016-09-03')])
t1

2016-09-01    a
2016-09-02    b
2016-09-03    c
dtype: object

In [ ]:
# Looking at the type of our series index, we see that it's DatetimeIndex.
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [ ]:
# Similarly, we can create a period-based index as well. 
t2 = pd.Series(list('def'), [pd.Period('2016-09'), pd.Period('2016-10'), 
                             pd.Period('2016-11')])
t2

2016-09    d
2016-10    e
2016-11    f
Freq: M, dtype: object

#### Converting to Datetime

In [ ]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']

ts3 = pd.DataFrame(np.random.randint(10, 100, (4,2)), index=d1, 
                   columns=list('ab'))
ts3

               a   b
2 June 2013   92  29
Aug 29, 2014  20  82
2015-06-26    78  26
7/12/16       49  66

In [ ]:
# Using pandas to_datetime, pandas will try to convert these to Datetime and put 
# them in a standard format.

ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b
2013-06-02  92  29
2014-08-29  20  82
2015-06-26  78  26
2016-07-12  49  66

In [ ]:
# to_datetime() also has options to change the date parse order. For example, we 
# can pass in the argument dayfirst = True to parse the date in European date.

pd.to_datetime('4.7.12', dayfirst=True)

Timestamp('2012-07-04 00:00:00')

#### Timedelta

In [ ]:
# Timedeltas are differences in times. This is not the same as a a period, but conceptually similar. For
# instance, if we want to take the difference between September 3rd and  September 1st, we get a Timedelta of
# two days.
pd.Timestamp('9/3/2016')-pd.Timestamp('9/1/2016')

Timedelta('2 days 00:00:00')

In [ ]:
# We can also do something like find what the date and time is for 12 days and three hours past September 2nd,
# at 8:10 AM.
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2016-09-14 11:10:00')

#### Offset

In [ ]:
# Offset is similar to timedelta, but it follows specific calendar duration rules. Offset allows flexibility
# in terms of types of time intervals. Besides hour, day, week, month, etc it also has business day, end of
# month, semi month begin etc

# Let's create a timestamp, and see what day is that
pd.Timestamp('9/4/2016').weekday()

6

In [ ]:
# Now we can now add the timestamp with a week ahead
pd.Timestamp('9/4/2016') + pd.offsets.Week()  # 4+7=11

Timestamp('2016-09-11 00:00:00')

In [ ]:
# Now let's try to do the month end, then we would have the last day of September
pd.Timestamp('9/4/2016') + pd.offsets.MonthEnd()

Timestamp('2016-09-30 00:00:00')

#### Working with Dates in a Dataframe

In [ ]:
# Next, let's look at a few tricks for working with dates in a DataFrame. Suppose we want to look at nine
# measurements, taken bi-weekly, every Sunday, starting in October 2016. Using date_range, we can create this
# DatetimeIndex. In data_range, we have to either specify the start or end date. If it is not explicitly
# specified, by default, the date is considered the start date. Then we have to specify number of periods, and
# a frequency. Here, we set it to "2W-SUN", which means biweekly on Sunday

dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [ ]:
# There are many other frequencies that you can specify. 
# For example, you can do business day
pd.date_range('10-01-2016', periods=9, freq='B')

DatetimeIndex(['2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06',
               '2016-10-07', '2016-10-10', '2016-10-11', '2016-10-12',
               '2016-10-13'],
              dtype='datetime64[ns]', freq='B')

In [ ]:
# Or you can do quarterly, with the quarter start in June
pd.date_range('04-01-2016', periods=12, freq='QS-JUN')

DatetimeIndex(['2016-06-01', '2016-09-01', '2016-12-01', '2017-03-01',
               '2017-06-01', '2017-09-01', '2017-12-01', '2018-03-01',
               '2018-06-01', '2018-09-01', '2018-12-01', '2019-03-01'],
              dtype='datetime64[ns]', freq='QS-JUN')

In [ ]:
# Now, let's go back to our weekly on Sunday example and create a DataFrame 
# using these dates, and some random data, and see what we can do with it.

dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                  'Count 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)
df

            Count 1  Count 2
2016-10-02      101      127
2016-10-16      108      119
2016-10-30      114      120
2016-11-13      113      127
2016-11-27      115      115
2016-12-11      118      122
2016-12-25      117      119
2017-01-08      118      118
2017-01-22      124      124

In [ ]:
df.index.weekday

Int64Index([6, 6, 6, 6, 6, 6, 6, 6, 6], dtype='int64')

In [ ]:
# We can also use diff() to find the difference between each date's value.
df.diff()

            Count 1  Count 2
2016-10-02      NaN      NaN
2016-10-16      7.0     -8.0
2016-10-30      6.0      1.0
2016-11-13     -1.0      7.0
2016-11-27      2.0    -12.0
2016-12-11      3.0      7.0
2016-12-25     -1.0     -3.0
2017-01-08      1.0     -1.0
2017-01-22      6.0      6.0

In [ ]:
# Suppose we want to know what the mean count is for each month in our DataFrame. We can do this using
# resample. Converting from a higher frequency from a lower frequency is called downsampling
df.resample('M').mean()

               Count 1  Count 2
2016-10-31  107.666667    122.0
2016-11-30  114.000000    121.0
2016-12-31  117.500000    120.5
2017-01-31  121.000000    121.0

In [ ]:
# Now let's talk about datetime indexing and slicing, which is a wonderful feature of the pandas DataFrame.
# For instance, we can use partial string indexing to find values from a particular year,
df['2017']

            Count 1  Count 2
2017-01-08      118      118
2017-01-22      124      124

In [ ]:
# Or we can even slice on a range of dates For example, here we only want the values from December 2016
# onwards.
df['2016-12':]

            Count 1  Count 2
2016-12-11      118      122
2016-12-25      117      119
2017-01-08      118      118
2017-01-22      124      124